<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7d01c6b6b70e4cd3d41dc3ab515b9a3debd0afe3cae602c56a57e7fe008b8783","plan_job_ref":"Job Terraform Plan #11 at https://github.com/getsentry/security-cloud-functions-template/actions/runs/10692889806","plan_hash":"37d8e9348660699184cd1b1d111d529fc86bb9d6b6ee440edbeb0e977a5c967d","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 1 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.functions.module.cloud_function["get-gh-app-token"].google_cloudfunctions_function.function will be updated in-place
  ~ resource "google_cloudfunctions_function" "function" {
        id                            = "projects/jeffreyhung-test/locations/us-west1/functions/get-gh-app-token"
        name                          = "get-gh-app-token"
      ~ source_archive_object         = "src-4796f0aff8f73aec06b202690e1ba7a6.zip" -> "src-989adf691d3a45530f1902481ebe44c2.zip"
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.module.cloud_function["get-gh-app-token"].google_storage_bucket_object.zip must be replaced
-/+ resource "google_storage_bucket_object" "zip" {
      + content             = (sensitive value)
      ~ crc32c              = "Z5t+Qw==" -> (known after apply)
      ~ detect_md5hash      = "R5bwr/j3OuwGsgJpDhunpg==" -> "different hash"
      - event_based_hold    = false -> null
      ~ generation          = 1724966207506348 -> (known after apply)
      ~ id                  = "********************************************************************************" -> (known after apply)
      + kms_key_name        = (known after apply)
      ~ md5hash             = "R5bwr/j3OuwGsgJpDhunpg==" -> (known after apply)
      ~ media_link          = "https://storage.googleapis.com/download/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-4796f0aff8f73aec06b202690e1ba7a6.zip?generation=1724966207506348&alt=media" -> (known after apply)
      - metadata            = {} -> null
      ~ name                = "src-4796f0aff8f73aec06b202690e1ba7a6.zip" -> "src-989adf691d3a45530f1902481ebe44c2.zip" # forces replacement
      ~ output_name         = "src-4796f0aff8f73aec06b202690e1ba7a6.zip" -> (known after apply)
      ~ self_link           = "https://www.googleapis.com/storage/v1/b/jeffreyhung-test-cloud-function-staging/o/src-4796f0aff8f73aec06b202690e1ba7a6.zip" -> (known after apply)
      ~ storage_class       = "STANDARD" -> (known after apply)
      - temporary_hold      = false -> null
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [Terraform Apply #9](https://github.com/getsentry/security-cloud-functions-template/actions/runs/12999110996)